---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PointFailures.HostParameterRangeError
source: html/c8cbb1c0-aa38-c0d6-d341-7410bfa61141.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures.HostParameterRangeError Property

Hosted Parameter must be between 0 and 1

## Syntax (C#)
```csharp
public static FailureDefinitionId HostParameterRangeError { get; }
```